Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.Offset Structure
 Defines parameters associated with the start and end of the spacing.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public struct Offset
<SerializableAttribute>
Public Structure Offset
The RebarSpacing.Offset type exposes the following members.
Constructors
Name | Description
RebarSpacing.Offset
 Initializes a new instance of the RebarSpacing.Offset struct.
Top
Fields
Name | Description
Automatic
 Defines whether the offset distance is to be automatically calculated.
Distance
 The distance.
Type
 Defines whether the distance is intended as a fixed or a minimum distance.
Top
See Also
Reference
Tekla.Structures.Model Namespace